[
  {
    "id": "email-password",
    "title": "Я забыл пароль от почты",
    "category": "Почта",
    "keywords": ["почта", "пароль", "войти", "забыл"],
    "content": [
      "Откройте сайт вашей почты (например, mail.ru или gmail.com).",
      "Нажмите на кнопку «Забыли пароль?» или «Восстановить доступ». Обычно она находится под полем для ввода пароля.",
      "Введите номер телефона или адрес резервной электронной почты, которые привязаны к вашему аккаунту.",
      "Проверьте телефон или резервную почту. Вы получите SMS или письмо с кодом подтверждения. Введите его в поле на сайте.",
      "Придумайте новый пароль. Он должен быть не слишком простым (например, не «123456»). Запомните его или запишите на бумажку."
    ]
  },
  {
    "id": "no-internet",
    "title": "Не работает интернет",
    "category": "Интернет",
    "keywords": ["интернет", "не работает", "сеть", "Wi-Fi"],
    "content": [
      "Проверьте, включён ли у вас Wi-Fi. Нажмите на значок сети в правом верхнем углу экрана. Убедитесь, что он активен.",
      "Если вы используете мобильный интернет, проверьте, включён ли он и есть ли сигнал (полоски у значка антенны).",
      "Попробуйте перезагрузить ваш телефон или компьютер: выключите его полностью и включите снова.",
      "Откройте любой сайт, например, google.com. Если он не открывается, проблема может быть с вашим провайдером интернета.",
      "Если ничего не помогает, позвоните в службу поддержки вашего провайдера."
    ]
  },
  {
    "id": "online-payment",
    "title": "Не получается оплатить картой",
    "category": "Онлайн-оплата",
    "keywords": ["оплата", "карта", "платёж", "онлайн", "ошибка"],
    "content": [
      "Проверьте, хватает ли денег на вашей карте. Иногда деньги списываются, но операция не проходит.",
      "Убедитесь, что ваша карта не заблокирована. Позвоните в банк, если не уверены.",
      "Вводите данные карты внимательно: номер, срок действия, имя владельца (латиницей) и CVV-код (три цифры сзади).",
      "Если система выдаёт ошибку, прочитайте её внимательно. Иногда там пишут причину.",
      "Если оплата не проходит несколько раз подряд, свяжитесь с банком или службой поддержки сайта."
    ]
  },
  {
    "id": "create-email",
    "title": "Как создать электронную почту",
    "category": "Почта",
    "keywords": ["почта", "новая", "аккаунт", "gmail", "mail"],
    "content": [
      "Откройте браузер и зайдите на сайт, где можно создать почту. Например, mail.ru или accounts.google.com для Gmail.",
      "Найдите и нажмите кнопку «Создать аккаунт» или «Зарегистрироваться».",
      "Введите свои данные: имя, фамилию, придумайте имя для новой почты (например, vasya_pupkin2025).",
      "Придумайте надёжный пароль и подтвердите его. Укажите резервный номер телефона или другую почту.",
      "Прочитайте правила и нажмите «Создать аккаунт». После этого вы сможете заходить в свою новую почту."
    ]
  },
  {
    "id": "find-app",
    "title": "Как найти и установить приложение",
    "category": "Приложения",
    "keywords": ["приложение", "скачать", "Play Market", "App Store", "установить"],
    "content": [
      "Откройте магазин приложений. На Android это «Google Play», на iPhone – «App Store».",
      "В строке поиска введите название нужного приложения, например, «Telegram» или «ВКонтакте».",
      "Найдите нужное приложение в списке результатов и нажмите на него.",
      "Нажмите кнопку «Установить» или «Загрузить». Приложение начнёт скачиваться и установится автоматически.",
      "После установки иконка приложения появится на вашем рабочем столе. Нажмите на неё, чтобы открыть."
    ]
  },
  {
    "id": "use-wifi",
    "title": "Как подключиться к Wi-Fi",
    "category": "Интернет",
    "keywords": ["Wi-Fi", "подключиться", "сеть", "домашний интернет"],
    "content": [
      "Нажмите на значок Wi-Fi (обычно выглядит как «лучики») в шторке уведомлений или в настройках телефона.",
      "Список доступных сетей появится на экране. Найдите сеть, название которой указано наклейке на обороте вашего роутера.",
      "Нажмите на название вашей сети.",
      "Введите пароль от Wi-Fi. Его можно найти на обороте роутера, там же, где и название сети. Введите правильно, учитывая большие и маленькие буквы.",
      "Нажмите «Подключиться». Если всё сделано верно, сеть перейдёт в раздел подключённых, изменит цвет или рядом появится галочка."
    ]
  },
  {
    "id": "change-password",
    "title": "Как изменить пароль на телефоне",
    "category": "Безопасность",
    "keywords": ["пароль", "разблокировка", "PIN", "графический ключ", "PIN-код"],
    "content": [
      "Откройте «Настройки» на вашем телефоне. Это обычно иконка с шестерёнкой.",
      "Прокрутите вниз и найдите раздел «Безопасность» или «Экран блокировки и безопасность».",
      "Выберите «Экран блокировки» или «Разблокировка». Здесь вы можете выбрать новый способ: PIN-код (цифры), графический ключ (рисунок) или пароль.",
      "Введите старый пароль, если он был.",
      "Придумайте и дважды введите новый способ разблокировки. Подтвердите выбор. Теперь телефон будет разблокироваться по-новому."
    ]
  },
  {
    "id": "backup-phone",
    "title": "Как сделать резервную копию контактов и фото",
    "category": "Безопасность",
    "keywords": ["резервная копия", "контакты", "фото", "облако", "Google", "Yandex"],
    "content": [
      "Откройте «Настройки» на телефоне.",
      "Найдите раздел «Облако и синхронизация» или «Аккаунт» (может называться Google, Yandex и т.п.).",
      "Выберите ваш аккаунт (например, Google) и включите синхронизацию для «Контактов» и «Фото».",
      "Если у вас нет аккаунта, создайте его. Это бесплатно и безопасно.",
      "Теперь все ваши важные данные будут автоматически сохраняться в облаке. Если телефон потеряется или сломается, вы сможете восстановить их."
    ]
  },
  {
    "id": "video-call",
    "title": "Как сделать видеозвонок",
    "category": "Общение",
    "keywords": ["видеозвонок", "Telegram", "WhatsApp", "Skype", "лицо", "камера"],
    "content": [
      "Откройте приложение, через которое хотите звонить: Telegram, WhatsApp, Viber и т.д.",
      "Найдите нужный контакт в списке и нажмите на него.",
      "Найдите и нажмите на значок видеокамеры или «Видеозвонок».",
      "Подождите, пока собеседник ответит. Убедитесь, что у вас включена камера и микрофон.",
      "Говорите и смотрите в камеру, как будто вы сидите напротив. Чтобы завершить звонок, нажмите красную кнопку."
    ]
  },
  {
    "id": "order-taxi",
    "title": "Как заказать такси через приложение",
    "category": "Мобильные услуги",
    "keywords": ["такси", "Yandex Taxi", "Uber", "заказать", "поездка"],
    "content": [
      "Скачайте и установите приложение такси, например, «Яндекс.Такси» или «Uber».",
      "Откройте приложение и разрешите ему использовать геолокацию (местоположение).",
      "Введите адрес, откуда вы будете ехать, и куда нужно приехать.",
      "Приложение покажет стоимость поездки и примерное время ожидания.",
      "Нажмите «Заказать». Машина приедет к вам. После поездки оплатите, как указано в приложении."
    ]
  },
  {
    "id": "buy-online-ticket",
    "title": "Как купить билет на автобус или поезд онлайн",
    "category": "Онлайн-сервисы",
    "keywords": ["билет", "поезд", "автобус", "RZD", "онлайн", "оплата"],
    "content": [
      "Откройте официальный сайт РЖД (rzd.ru) или приложение.",
      "Введите станцию отправления и прибытия, дату поездки.",
      "Выберите подходящий поезд и место.",
      "Введите данные пассажира (ФИО, номер телефона).",
      "Выберите способ оплаты и оплатите билет. После этого вы получите электронный билет на email или в приложение."
    ]
  },
  {
    "id": "update-android",
    "title": "Как обновить Android",
    "category": "Система",
    "keywords": ["обновление", "Android", "система", "безопасность", "производительность"],
    "content": [
      "Откройте «Настройки».",
      "Прокрутите вниз и нажмите «Система» или «Обновление системы».",
      "Выберите «Проверить наличие обновлений».",
      "Если обновление есть, следуйте инструкциям на экране. Обычно нужно скачать и установить.",
      "Устройство перезагрузится. После этого вы будете использовать новую версию Android."
    ]
  },
  {
    "id": "clean-storage",
    "title": "Как освободить место на телефоне",
    "category": "Система",
    "keywords": ["память", "хранилище", "очистить", "фото", "кашалот", "Android"],
    "content": [
      "Откройте «Настройки».",
      "Найдите «Хранилище» или «Память».",
      "Посмотрите, какие приложения занимают больше всего места.",
      "Удалите старые фото и видео, которые вам не нужны. Или перенесите их в облако.",
      "Удалите ненужные приложения, которые вы давно не используете."
    ]
  },
  {
    "id": "use-bank-app",
    "title": "Как пользоваться банковским приложением",
    "category": "Онлайн-оплата",
    "keywords": ["банк", "приложение", "баланс", "перевод", "оплата"],
    "content": [
      "Скачайте официальное приложение вашего банка (например, Сбербанк Онлайн, Тинькофф).",
      "Зарегистрируйтесь или войдите, если у вас уже есть аккаунт.",
      "Вы увидите список своих карт и счетов. Здесь можно посмотреть баланс.",
      "Для перевода денег нажмите «Перевести» и введите номер карты получателя.",
      "Для оплаты услуг (свет, интернет) выберите нужную категорию и введите реквизиты."
    ]
  },
  {
    "id": "turn-off-data",
    "title": "Как отключить мобильный интернет",
    "category": "Интернет",
    "keywords": ["мобильный интернет", "передача данных", "экономия", "тариф"],
    "content": [
      "Потяните вниз шторку уведомлений.",
      "Найдите значок «Мобильный интернет» или «Передача данных». Он может выглядеть как буква «E», «3G», «4G» или «5G».",
      "Нажмите на него. Если он был включен (цветной), то станет серым – значит, отключен.",
      "Теперь вы не будете тратить интернет-трафик, пока не подключитесь к Wi-Fi."
    ]
  },
  {
    "id": "set-alarm",
    "title": "Как установить будильник",
    "category": "Система",
    "keywords": ["будильник", "часы", "проснуться", "время"],
    "content": [
      "Найдите на телефоне приложение «Часы». Обычно это иконка с циферблатом.",
      "Перейдите во вкладку «Будильник».",
      "Нажмите кнопку «+» или «Добавить».",
      "Установите нужное время с помощью колесика или ввода цифр.",
      "Можно включить повтор (например, по будням) и выбрать мелодию. Нажмите «Сохранить»."
    ]
  },
  {
    "id": "share-location",
    "title": "Как поделиться своим местоположением",
    "category": "Общение",
    "keywords": ["местоположение", "геолокация", "поделиться", "где я", "Telegram", "WhatsApp"],
    "content": [
      "Откройте чат с человеком, которому хотите отправить место.",
      "Нажмите на значок скрепки (или +) в поле ввода сообщения.",
      "Выберите «Местоположение» или «Location».",
      "Разрешите приложению использовать ваше местоположение, если спросят.",
      "Подтвердите отправку. Ваш собеседник увидит, где вы находитесь, на карте."
    ]
  },
  {
    "id": "translate-text",
    "title": "Как перевести текст с иностранного языка",
    "category": "Приложения",
    "keywords": ["перевод", "Google Translate", "язык", "текст", "инностранный"],
    "content": [
      "Скачайте приложение «Google Переводчик» или аналогичное.",
      "Откройте приложение.",
      "Выберите исходный язык (с которого переводите) и целевой (на который переводите).",
      "Введите или вставьте текст в верхнее поле, или сфотографируйте его с помощью камеры.",
      "Перевод появится в нижнем поле. Можно прослушать произношение."
    ]
  },
  {
    "id": "connect-headphones",
    "title": "Как подключить беспроводные наушники",
    "category": "Устройства",
    "keywords": ["наушники", "Bluetooth", "подключить", "звук", "беспроводные"],
    "content": [
      "Включите Bluetooth на вашем телефоне: потяните шторку уведомлений и нажмите на значок Bluetooth.",
      "Включите наушники и переведите их в режим сопряжения (обычно нужно долго удерживать кнопку питания, пока не мигнёт светодиод).",
      "На телефоне появится список доступных устройств. Найдите там название ваших наушников.",
      "Нажмите на название наушников. Ждите подключения. Когда подключится, на экране появится уведомление."
    ]
  },
  {
    "id": "delete-message",
    "title": "Как удалить сообщение в чате",
    "category": "Общение",
    "keywords": ["сообщение", "удалить", "чат", "Telegram", "WhatsApp"],
    "content": [
      "Откройте чат, в котором находится сообщение.",
      "Нажмите и удерживайте нужное сообщение, пока не появятся дополнительные кнопки.",
      "Выберите значок корзины или «Удалить».",
      "Подтвердите удаление. Сообщение исчезнет. Обратите внимание: в некоторых приложениях это удалит сообщение только у вас, в других — у всех в чате."
    ]
  },
  {
    "id": "use-maps",
    "title": "Как пользоваться картами на телефоне",
    "category": "Приложения",
    "keywords": ["карта", "GPS", "навигация", "Google Maps", "Яндекс.Карты", "где я"],
    "content": [
      "Откройте приложение карт, например, Google Maps или Яндекс.Карты.",
      "Разрешите приложению использовать ваше местоположение.",
      "В поле поиска введите, куда вы хотите попасть, например, «аптека» или «Пушкинская, 10».",
      "Приложение покажет вам маршруты, если вы хотите туда дойти или доехать. Выберите подходящий.",
      "Следуйте указаниям на карте: она покажет, когда поворачивать и сколько осталось до цели."
    ]
  },
  {
    "id": "print-from-phone",
    "title": "Как распечатать документ с телефона",
    "category": "Устройства",
    "keywords": ["печать", "принтер", "документ", "PDF", "Android", "Bluetooth"],
    "content": [
      "Убедитесь, что ваш принтер поддерживает печать с телефона и подключен к той же сети Wi-Fi.",
      "Откройте документ, который хотите распечатать (в браузере, PDF-ридере или файловом менеджере).",
      "Нажмите на значок «Поделиться» или «...» (ещё).",
      "Выберите «Печать» или «Print».",
      "Выберите ваш принтер из списка. Если его нет, возможно, потребуется установить специальное приложение от производителя принтера.",
      "Настройте параметры печати (цвет, количество копий) и нажмите «Распечатать»."
    ]
  },
  {
    "id": "block-number",
    "title": "Как заблокировать номер телефона",
    "category": "Безопасность",
    "keywords": ["номер", "заблокировать", "спам", "звонки", "черный список"],
    "content": [
      "Откройте приложение «Телефон».",
      "Перейдите во вкладку «Недавние вызовы».",
      "Найдите звонок от нежелательного номера и нажмите на него.",
      "Выберите «Заблокировать» или «Добавить в черный список».",
      "Подтвердите действие. Теперь с этого номера вам не будут звонить и писать (если используется и SMS)."
    ]
  },
  {
    "id": "use-flashlight",
    "title": "Как включить фонарик",
    "category": "Система",
    "keywords": ["фонарик", "вспышка", "свет", "быстрый доступ"],
    "content": [
      "Потяните вниз шторку уведомлений.",
      "Найдите значок фонарика (обычно выглядит как маленькая лампочка или вспышка).",
      "Нажмите на него. Фонарик включится. Нажмите ещё раз, чтобы выключить.",
      "Некоторые телефоны позволяют включить фонарик с экрана блокировки, если провести по нему определённым жестом."
    ]
  },
  {
    "id": "check-battery-health",
    "title": "Как проверить состояние аккумулятора",
    "category": "Система",
    "keywords": ["аккумулятор", "состояние", "здоровье", "заряд", "Android"],
    "content": [
      "Откройте «Настройки».",
      "Найдите раздел «Аккумулятор» или «Электропитание».",
      "Посмотрите информацию о времени работы, состоянии и использовании энергии приложениями.",
      "В некоторых телефонах есть специальная опция «Состояние аккумулятора» или «Здоровье». Она покажет, насколько хорошо ваш аккумулятор сохранился со временем.",
      "Если состояние плохое (например, ниже 80%), возможно, стоит заменить аккумулятор."
    ]
  },
  {
    "id": "send-screenshot",
    "title": "Как сделать и отправить скриншот",
    "category": "Система",
    "keywords": ["скриншот", "фото экрана", "отправить", "поделиться", "Android"],
    "content": [
      "Нажмите и удерживайте одновременно кнопку питания и кнопку уменьшения громкости.",
      "Экран мигнёт — значит, скриншот сделан.",
      "Нажмите на миниатюру скриншота, которая появилась в нижней части экрана.",
      "Выберите «Поделиться» и отправьте его в нужный чат или по почте."
    ]
  },
  {
    "id": "manage-notifications",
    "title": "Как настроить уведомления",
    "category": "Система",
    "keywords": ["уведомления", "настройки", "тихо", "много", "отключить"],
    "content": [
      "Потяните вниз шторку уведомлений.",
      "Нажмите на значок шестерёнки (или «Настройки») рядом с последним уведомлением от нужного приложения.",
      "Выберите «Настроить уведомления».",
      "Здесь можно отключить уведомления совсем, или настроить, какие именно типы уведомлений вы хотите получать.",
      "Также можно включить «Не беспокоить», чтобы временно отключить почти все уведомления."
    ]
  },
  {
    "id": "sync-calendar",
    "title": "Как синхронизировать календарь с облаком",
    "category": "Приложения",
    "keywords": ["календарь", "облако", "Google", "Yandex", "события", "планы"],
    "content": [
      "Откройте приложение «Календарь».",
      "Перейдите в настройки (обычно значок с тремя точками или шестерёнкой).",
      "Найдите раздел «Аккаунты» или «Синхронизация».",
      "Добавьте ваш аккаунт (Google, Yandex и т.п.) и включите синхронизацию для календаря.",
      "Теперь все события, которые вы добавите, будут автоматически сохраняться в облаке и доступны с других устройств."
    ]
  },
  {
    "id": "use-screen-reader",
    "title": "Как включить и использовать говорилку (для слабовидящих)",
    "category": "Система",
    "keywords": ["экранная читалка", "говорилка", "доступность", "слабовидящие", "TalkBack"],
    "content": [
      "Откройте «Настройки».",
      "Перейдите в раздел «Специальные возможности» или «Accessibility».",
      "Найдите и включите функцию «Экранная читалка» (на Android это обычно TalkBack).",
      "Прочитайте краткое руководство, которое появится.",
      "Теперь, когда вы касаетесь экрана, система будет проговаривать, что находится под пальцем. Это поможет ориентироваться без зрения."
    ]
  },
  {
    "id": "reset-network-settings",
    "title": "Как сбросить настройки сети",
    "category": "Интернет",
    "keywords": ["Wi-Fi", "сеть", "сброс", "настройки", "проблемы", "соединение"],
    "content": [
      "Откройте «Настройки».",
      "Перейдите в раздел «Система» или «Дополнительно».",
      "Выберите «Сброс» или «Сброс настроек».",
      "Найдите опцию «Сброс настроек сети» или «Сбросить настройки Wi-Fi, мобильной связи и Bluetooth».",
      "Подтвердите действие. Это удалит все сохранённые сети Wi-Fi и Bluetooth, но может решить проблемы с подключением."
    ]
  },
  {
    "id": "organize-home-screen",
    "title": "Как организовать иконки на главном экране",
    "category": "Система",
    "keywords": ["иконки", "главный экран", "папки", "организовать", "убрать"],
    "content": [
      "Нажмите и удерживайте иконку приложения, которое хотите переместить.",
      "Перетащите её на другую иконку — автоматически создастся папка. Назовите её, например, «Соцсети».",
      "Чтобы убрать приложение с главного экрана, но не удалять его, перетащите иконку в верхнюю часть экрана к значку корзины (иногда просто уберёт с экрана).",
      "Для создания виджета (например, погоды) нажмите и удерживайте пустое место на экране, затем выберите «Виджеты» и добавьте нужный."
    ]
  },
  {
    "id": "find-lost-phone",
    "title": "Как найти потерянный телефон",
    "category": "Безопасность",
    "keywords": ["потерял", "найти", "телефон", "Google", "Yandex", "звать", "локация"],
    "content": [
      "С другого устройства (или компьютера) откройте сайт, например, «Найти устройство» Google (android.com/find) или Яндекса.",
      "Войдите в тот же аккаунт, который был на пропавшем телефоне.",
      "Выберите своё устройство из списка.",
      "Вы можете заставить телефон зазвонить (даже если он на беззвучном), стереть данные или посмотреть его местоположение на карте.",
      "Если телефон рядом, но вы не можете его найти, используйте функцию «Звонок»."
    ]
  },
  {
    "id": "use-mobile-hotspot",
    "title": "Как использовать телефон как точку доступа Wi-Fi",
    "category": "Интернет",
    "keywords": ["модем", "Wi-Fi", "точка доступа", "раздать", "интернет", "Android"],
    "content": [
      "Откройте «Настройки».",
      "Найдите раздел «Сеть и интернет» или «Передача данных».",
      "Выберите «Мобильная точка доступа и модем» или «Режим модема».",
      "Включите «Точку доступа Wi-Fi».",
      "Нажмите «Настроить точку доступа», чтобы задать имя (SSID) и пароль для вашей Wi-Fi сети.",
      "Теперь другие устройства могут подключиться к вашему телефону как к Wi-Fi, используя заданные имя и пароль. Это расходует ваш мобильный интернет!"
    ]
  },
  {
    "id": "adjust-text-size",
    "title": "Как увеличить размер текста на экране",
    "category": "Система",
    "keywords": ["размер шрифта", "увеличить", "текст", "читать", "доступность"],
    "content": [
      "Откройте «Настройки».",
      "Перейдите в раздел «Дисплей» или «Экран».",
      "Найдите пункт «Размер шрифта» или «Масштабирование».",
      "Перетащите ползунок вправо, чтобы увеличить размер текста. Увеличится и текст в приложениях.",
      "Для более радикального увеличения найдите раздел «Специальные возможности» -> «Увеличение экрана»."
    ]
  },
  {
    "id": "check-app-permissions",
    "title": "Как проверить и ограничить права приложений",
    "category": "Безопасность",
    "keywords": ["разрешения", "права", "доступ", "камера", "микрофон", "контакты", "безопасность"],
    "content": [
      "Откройте «Настройки».",
      "Перейдите в раздел «Приложения» или «Приложения и уведомления».",
      "Выберите конкретное приложение, права которого хотите проверить.",
      "Нажмите «Разрешения».",
      "Здесь вы увидите список всех возможных разрешений (камера, микрофон, местоположение, контакты и т.д.) и текущий статус для каждого. Можете отключить ненужные."
    ]
  },
  {
    "id": "add-widget",
    "title": "Как добавить виджет на главный экран",
    "category": "Система",
    "keywords": ["виджет", "погода", "часы", "календарь", "информация", "экран"],
    "content": [
      "Нажмите и удерживайте пустое место на главном экране.",
      "Выберите «Виджеты» из появившегося меню.",
      "Прокрутите список доступных виджетов. Найдите нужный (например, «Погода» или «Часы»).",
      "Нажмите и удерживайте его, затем перетащите на свободное место на экране.",
      "Отпустите. Виджет появится и начнёт отображать информацию."
    ]
  },
  {
    "id": "disable-auto-brightness",
    "title": "Как отключить автоматическую регулировку яркости",
    "category": "Система",
    "keywords": ["яркость", "авто", "ручная", "настройка", "дисплей"],
    "content": [
      "Откройте «Настройки».",
      "Перейдите в раздел «Дисплей» или «Экран».",
      "Найдите пункт «Яркость».",
      "Отключите переключатель «Автоматическая яркость» или «Настройка яркости в зависимости от освещения».",
      "Теперь вы можете вручную регулировать яркость с помощью ползунка или кнопок на боковой панели."
    ]
  },
  {
    "id": "switch-keyboard-language",
    "title": "Как переключить язык клавиатуры",
    "category": "Система",
    "keywords": ["язык", "клавиатура", "русский", "английский", "ввод", "переключение"],
    "content": [
      "Когда вы вводите текст (в сообщении, поиске и т.д.), нажмите на значок клавиатуры в нижней части экрана (часто это «ABC» или «En/Ru»).",
      "Выберите нужный язык из списка. Обычно можно переключаться между языками, нажимая клавишу «Пробел» или специальную кнопку на клавиатуре.",
      "Некоторые клавиатуры позволяют переключаться языки, нажимая на кнопку с глобусом или клавишу Shift дважды."
    ]
  },
  {
    "id": "save-pdf-from-browser",
    "title": "Как сохранить веб-страницу в PDF",
    "category": "Система",
    "keywords": ["PDF", "веб-страница", "сохранить", "браузер", "документ", "печать"],
    "content": [
      "Откройте страницу в браузере (Chrome, Firefox и т.д.).",
      "Нажмите на значок «...» (ещё) в правом верхнем углу.",
      "Выберите «Печать» или «Share» -> «Print».",
      "В окне печати, вместо принтера, выберите «Сохранить в PDF» или «Сохранить как PDF».",
      "Нажмите «Печать» или «Сохранить». Файл будет сохранён в папку «Загрузки»."
    ]
  },
  {
    "id": "enable-two-factor-auth",
    "title": "Что такое двухфакторная аутентификация и как её включить",
    "category": "Безопасность",
    "keywords": ["безопасность", "двухфакторная", "аутентификация", "2FA", "пароль", "SMS", "приложение"],
    "content": [
      "Двухфакторная аутентификация (2FA) — это дополнительный уровень защиты. Помимо пароля, вас просят ввести код, который приходит на телефон или генерируется специальным приложением.",
      "Зайдите в настройки безопасности вашего аккаунта (например, Google, Mail.ru).",
      "Найдите раздел «Двухфакторная аутентификация» или «2-шаговая проверка».",
      "Включите её. Вам предложат выбрать способ получения кода: по SMS или с помощью приложения (например, Google Authenticator).",
      "Следуйте инструкциям. После включения, при каждом входе в аккаунт с нового устройства, кроме пароля, потребуется ввести код."
    ]
  },  {
    "id": "buy-online-groceries",
    "title": "Как заказать продукты онлайн",
    "category": "Онлайн-сервисы",
    "keywords": ["продукты", "доставка", "онлайн", "магазин", "Ozon", "ВкусВилл", "Еда"],
    "content": [
      "Скачайте приложение или откройте сайт службы доставки продуктов, например, Ozon, ВкусВилл, Перекрёсток или Delivery Club.",
      "Укажите ваш адрес доставки.",
      "Выберите нужные продукты, добавьте их в корзину.",
      "Проверьте состав заказа и выберите удобное время доставки.",
      "Оплатите заказ онлайн картой или наличными курьеру. После этого к вам приедет курьер с продуктами."
    ]
  },
  {
    "id": "find-doctor-online",
    "title": "Как записаться к врачу онлайн",
    "category": "Онлайн-сервисы",
    "keywords": ["врач", "запись", "онлайн", "поликлиника", "госуслуги", "телефон"],
    "content": [
      "Зайдите на портал Госуслуг (gosuslugi.ru) или в приложение вашего региона.",
      "Войдите в личный кабинет. Если у вас нет аккаунта, зарегистрируйтесь.",
      "Найдите раздел «Запись на приём к врачу».",
      "Выберите поликлинику, врача, специальность и удобное время.",
      "Подтвердите запись. Вам придет SMS или уведомление с подтверждением. Приходите в назначенное время."
    ]
  },
  {
    "id": "use-qr-code",
    "title": "Что такое QR-код и как его использовать",
    "category": "Система",
    "keywords": ["QR-код", "камера", "ссылка", "оплатить", "информация"],
    "content": [
      "QR-код — это квадратная картинка с чёрно-белыми пикселями, которая содержит информацию.",
      "Откройте приложение, которое умеет читать QR-коды. Это может быть камера на телефоне (часто работает автоматически), или специальное приложение.",
      "Наведите камеру телефона на QR-код. Держите ровно и не трясите.",
      "Телефон распознает код и предложит действие: открыть сайт, показать информацию или перейти к оплате.",
      "Подтвердите действие, если нужно."
    ]
  },
  {
    "id": "record-voice-note",
    "title": "Как записать голосовое сообщение",
    "category": "Система",
    "keywords": ["голос", "запись", "диктофон", "Android", "сохранить", "сообщение"],
    "content": [
      "Найдите на телефоне приложение «Диктофон» или «Запись голоса». Оно может быть в списке приложений или в «Инструментах».",
      "Откройте его и нажмите на кнопку с изображением микрофона или записи.",
      "Начнётся запись. Говорите чётко и не очень быстро.",
      "Когда закончите, нажмите «Стоп». Запись сохранится.",
      "Вы можете прослушать её, переименовать или поделиться."
    ]
  },
  {
    "id": "take-photo-video",
    "title": "Как делать фотографии и видео",
    "category": "Система",
    "keywords": ["фото", "видео", "камера", "Android", "сделать", "снять"],
    "content": [
      "Найдите и откройте приложение «Камера» на вашем телефоне.",
      "Наведите объектив камеры на объект, который хотите сфотографировать или снять.",
      "Для фото нажмите на большой круглый значок спуска затвора.",
      "Для видео нажмите на значок видеокамеры. Нажмите на круг, чтобы начать запись, и снова, чтобы остановить.",
      "Сделанные фото и видео сохраняются в галерее."
    ]
  },
  {
    "id": "edit-photo",
    "title": "Как немного подправить фотографию",
    "category": "Система",
    "keywords": ["фото", "редактировать", "галерея", "Android", "яркость", "обрезать"],
    "content": [
      "Откройте приложение «Галерея» и найдите нужное фото.",
      "Нажмите на него, чтобы открыть.",
      "Нажмите на значок «Редактировать» или «...» -> «Редактировать».",
      "Вы можете обрезать фото, изменить яркость, контрастность или насыщенность. Используйте ползунки.",
      "После редактирования нажмите «Сохранить» или галочку. Изменения применятся к копии фото."
    ]
  },
  {
    "id": "use-mobile-bank-for-transfers",
    "title": "Как перевести деньги другому человеку через банковское приложение",
    "category": "Онлайн-оплата",
    "keywords": ["перевод", "деньги", "банк", "карта", "телефон", "Сбербанк", "Тинькофф"],
    "content": [
      "Откройте приложение вашего банка.",
      "Найдите раздел «Переводы» или «Отправить деньги».",
      "Выберите способ перевода: по номеру телефона, по номеру карты или по реквизитам.",
      "Введите данные получателя (номер телефона или карты) и сумму перевода.",
      "Проверьте все данные и подтвердите перевод с помощью SMS или кода из приложения."
    ]
  },
  {
    "id": "pay-utilities-online",
    "title": "Как оплатить коммунальные услуги онлайн",
    "category": "Онлайн-оплата",
    "keywords": ["свет", "вода", "газ", "ЖКХ", "онлайн", "оплата", "банк"],
    "content": [
      "Откройте приложение вашего банка или портал Госуслуг.",
      "Найдите раздел «Платежи» или «Оплата услуг».",
      "Выберите категорию «ЖКХ и дом» или «Коммунальные услуги».",
      "Введите реквизиты из квитанции: номер лицевого счёта, ИНН организации и т.д.",
      "Проверьте сумму и оплатите. Сохраните чек для себя."
    ]
  },
  {
    "id": "watch-streaming-tv",
    "title": "Как смотреть фильмы и сериалы онлайн",
    "category": "Приложения",
    "keywords": ["фильмы", "сериалы", "YouTube", "IVI", "Kinopoisk", "онлайн", "смотреть"],
    "content": [
      "Скачайте приложение, где можно смотреть кино: YouTube, IVI, Kinopoisk HD или Okko.",
      "Откройте приложение. Некоторые могут требовать регистрацию или подписку.",
      "Используйте поиск, чтобы найти фильм или сериал по названию.",
      "Нажмите на название и выберите эпизод или фильм.",
      "Нажмите «Воспроизвести». Убедитесь, что у вас хорошее подключение к интернету."
    ]
  },
  {
    "id": "read-ebooks",
    "title": "Как читать электронные книги",
    "category": "Приложения",
    "keywords": ["электронная книга", "PDF", "FB2", "читалка", "LitRes", "Google Books"],
    "content": [
      "Скачайте приложение для чтения книг, например, LitRes, FB Reader или Google Books.",
      "Откройте приложение. Возможно, потребуется авторизация.",
      "Вы можете купить книгу в приложении или загрузить свою (если формат поддерживается).",
      "Откройте книгу. Здесь можно настроить шрифт, яркость, перелистывать страницы жестами.",
      "Прогресс чтения часто сохраняется, чтобы продолжить с того же места."
    ]
  },
  {
    "id": "use-file-manager",
    "title": "Как работать с файлами на телефоне",
    "category": "Система",
    "keywords": ["файлы", "документы", "картинки", "менеджер", "Android"],
    "content": [
      "Найдите и откройте приложение «Файлы» или «Проводник».",
      "Здесь вы увидите папки с вашими файлами: музыка, фото, документы, загрузки.",
      "Чтобы открыть файл, просто нажмите на него. Если приложение не установлено, телефон предложит его найти.",
      "Чтобы переместить или скопировать файл, нажмите и удерживайте его, затем выберите «Копировать» или «Вырезать» и укажите новое место.",
      "Чтобы удалить файл, нажмите и удерживайте его, затем «Удалить»."
    ]
  },
  {
    "id": "control-volume",
    "title": "Как регулировать громкость",
    "category": "Система",
    "keywords": ["громкость", "звук", "кнопки", "динамик", "наушники"],
    "content": [
      "На боковой стороне телефона есть физические кнопки (+ и -). Используйте их для изменения громкости.",
      "Когда вы что-то играет (музыка, видео), на экране может появиться ползунок громкости. Проведите по нему пальцем.",
      "Потяните вниз шторку уведомлений. Там тоже есть регуляторы громкости для разных типов звука (звонок, мультимедиа, будильник).",
      "Громкость в наушниках регулируется точно так же."
    ]
  },
  {
    "id": "set-quick-launch",
    "title": "Как настроить быстрый запуск приложений",
    "category": "Система",
    "keywords": ["быстрый запуск", "камера", "фонарик", "приложение", "жест"],
    "content": [
      "Откройте «Настройки».",
      "Найдите раздел «Дополнительно» или «Кнопки».",
      "Посмотрите, есть ли опция «Быстрый запуск» или «Двойное нажатие».",
      "Здесь можно настроить, например, двойное нажатие на кнопку питания для запуска камеры или удержание кнопки уменьшения громкости для включения фонарика.",
      "Выберите нужное действие и приложение, которое должно запускаться."
    ]
  },
  {
    "id": "lock-app-with-pin",
    "title": "Как защитить приложение PIN-кодом",
    "category": "Безопасность",
    "keywords": ["PIN", "защита", "приложение", "пароль", "конфиденциальность", "родительский контроль"],
    "content": [
      "Откройте «Настройки».",
      "Найдите раздел «Безопасность» или «Конфиденциальность».",
      "Ищите пункт вроде «Защита приложений» или «Родительский контроль». (Возможно, нужно установить специальное приложение от производителя телефона).",
      "Выберите приложения, которые хотите защитить.",
      "Придумайте PIN-код и подтвердите его.",
      "Теперь перед открытием этих приложений будет запрашиваться ваш код."
    ]
  },
  {
    "id": "share-contact",
    "title": "Как поделиться контактной информацией",
    "category": "Общение",
    "keywords": ["контакт", "поделиться", "телефон", "VCF", "QR-код"],
    "content": [
      "Откройте приложение «Контакты».",
      "Найдите нужный контакт и откройте его.",
      "Нажмите «Поделиться» (значок в виде стрелки или человечка).",
      "Выберите, каким способом отправить: по SMS, WhatsApp, Telegram или создать QR-код.",
      "Отправьте получателю. Он сможет сохранить этот контакт себе."
    ]
  },
  {
    "id": "create-and-share-folder",
    "title": "Как создать папку и поделиться ею",
    "category": "Облако",
    "keywords": ["облако", "папка", "Google Drive", "Yandex Disk", "поделиться", "доступ"],
    "content": [
      "Откройте приложение облачного хранилища (Google Drive, Яндекс.Диск и т.п.).",
      "Нажмите на кнопку «+» или «Создать».",
      "Выберите «Папка». Придумайте название.",
      "Откройте созданную папку.",
      "Нажмите на значок «Поделиться» или «...» -> «Поделиться».",
      "Введите email или выберите контакт, с кем хотите поделиться. Выберите уровень доступа (просмотр, редактирование).",
      "Отправьте приглашение. Получатель получит доступ к этой папке."
    ]
  },
  {
    "id": "use-cloud-storage",
    "title": "Что такое облачное хранилище и как его использовать",
    "category": "Облако",
    "keywords": ["облако", "хранилище", "Google Drive", "Yandex Disk", "файлы", "резервная копия"],
    "content": [
      "Облачное хранилище — это место в интернете, где можно хранить файлы, как на флешке, но доступной с любого устройства.",
      "Зарегистрируйтесь в сервисе, например, Google (gmail.com) или Яндекс (ya.ru). У вас будет бесплатное место.",
      "Скачайте приложение (Google Drive, Яндекс.Диск) и войдите в него под своим аккаунтом.",
      "Теперь вы можете загружать файлы из телефона в облако и наоборот. Это удобно для резервного копирования и доступа с других устройств."
    ]
  },
  {
    "id": "find-hidden-settings",
    "title": "Где находятся скрытые настройки производительности",
    "category": "Система",
    "keywords": ["разработчик", "настройки", "производительность", "анимации", "ускорение"],
    "content": [
      "Откройте «Настройки».",
      "Прокрутите вниз и найдите «О телефоне» или «Сведения о программном обеспечении».",
      "Несколько раз подряд нажмите на строку «Номер сборки» (или «Версия»). Через 5-7 нажатий появится уведомление о том, что вы стали разработчиком.",
      "Вернитесь в основное меню настроек. Появится новый пункт «Для разработчиков».",
      "Там можно отключить анимации, настроить отрисовку и другие параметры, влияющие на скорость работы (но будьте осторожны)."
    ]
  },
  {
    "id": "use-voice-search",
    "title": "Как искать информацию голосом",
    "category": "Система",
    "keywords": ["голосовой поиск", "говорить", "Google", "ассистент", "Android"],
    "content": [
      "Откройте приложение Google или нажмите кнопку поиска на главном экране.",
      "Найдите значок микрофона рядом с полем ввода.",
      "Нажмите на него и начинайте говорить вопрос вслух: например, «Какая сегодня погода в Ростове?».",
      "Система распознает ваш голос и выполнит поиск.",
      "Можно также сказать «ОК Google» (если функция включена), чтобы вызвать помощника и задать вопрос."
    ]
  },
  {
    "id": "schedule-message",
    "title": "Как отправить сообщение в назначенное время",
    "category": "Общение",
    "keywords": ["отложить", "отправить", "сообщение", "таймер", "Telegram", "SMS"],
    "content": [
      "В большинстве случаев это делается через сторонние приложения, так как в стандартных приложениях такой функции нет.",
      "Найдите в Play Market приложение для отложенных сообщений, например, «Scheduled SMS».",
      "Откройте его, введите текст сообщения, укажите номер телефона получателя и время отправки.",
      "Сохраните. Сообщение отправится в назначенное время."
    ]
  }
]
